УчетВУправляющихДляГит1/src/Reports/КнигаУчетаДоходовПатент/КнигаУчетаДоходовПатент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>КнигаУчетаДоходовПатент</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Патент</name>
    <type>
      <types>CatalogRef.Патенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокСформированныхЛистов</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
</mdclass:Report>

УчетВУправляющихДляГит1/src/AccumulationRegisters/КнигаУчетаДоходовПатент/КнигаУчетаДоходовПатент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КнигаУчетаДоходовПатент</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Графа4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитыПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроведения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипыОплат</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Патент</name>
    <type>
      <types>CatalogRef.Патенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УчетВУправляющихДляГит1/src/Enums/ПостановкаНаУчетВНалоговомОргане/ПостановкаНаУчетВНалоговомОргане.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПостановкаНаУчетВНалоговомОргане</name>
  <enumValues>
    <name>ПоМестуНахожденияОрганизации</name>
  </enumValues>
  <enumValues>
    <name>СДругимКодомПоОКАТО</name>
  </enumValues>
  <enumValues>
    <name>ВДругомНалоговомОргане</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Catalogs/БанковскиеСчета/БанковскиеСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БанковскиеСчета</name>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.Организации</owners>
  <owners>Catalog.ФизическиеЛица</owners>
  <owners>Catalog.КВП_Здания</owners>
  <attributes>
    <name>НомерСчета</name>
    <comment>Номер расчетного счета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>34</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </attributes>
  <attributes>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДенежныхСредств</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИДатаРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <comment>Дата открытия счета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <comment>Дата закрытия счета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>БанкДляРасчетов</name>
    <comment>Банк, в случае непрямых расчетов</comment>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСчета</name>
    <comment>Расчетный, депозитный, ссудный, иной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстКорреспондента</name>
    <comment>Текст &quot;Плательщик\Получатель&quot; в платежных документах</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстНазначения</name>
    <comment>Текст назначения платежа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>210</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МесяцПрописью</name>
    <comment>Указывать в дате документа месяц прописью</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезКопеек</name>
    <comment>Указывать сумму без копеек, если она в целых рублях</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегдаУказыватьКПП</name>
    <comment>Всегда указывать КПП в платежных документах</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГосударственныйКонтракт</name>
    <type>
      <types>CatalogRef.ГосКонтракты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКорпоративныхРасчетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетБанк</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Catalogs/Патенты/Патенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Патенты</name>
  <comment>Патенты на осуществление видов деятельности</comment>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПотенциальноВозможныйГодовойДоход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПервогоПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервогоПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВторогоПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВторогоПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйОрган</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостановкаНаУчетВНалоговомОргане</name>
    <type>
      <types>EnumRef.ПостановкаНаУчетВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПатента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРасходыУменьшающиеНалог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Catalogs/РегистрацииВНалоговомОргане/РегистрацииВНалоговомОргане.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РегистрацииВНалоговомОргане</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Доверенность</name>
    <comment>Доверенность налогоплательщика на представителя</comment>
    <type>
      <types>CatalogRef.ДоверенностиНалогоплательщика</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПредставителя</name>
    <comment>Название документа, подтверждающего полномочия представителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>Код причины постановки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИФНС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОбособленногоПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представитель</name>
    <comment>Представитель в территориальном органе ФНС</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДоверенность</name>
    <comment>Доверенность налогоплательщика на представителя</comment>
    <type>
      <types>CatalogRef.ДоверенностиНалогоплательщика</types>
    </type>
  </attributes>
  <attributes>
    <name>УполномоченноеЛицоПредставителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодРегиона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСлужебное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостановкиНаУчет</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСнятияСУчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Reports/КнигаУчетаДоходовПатент/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура СформироватьОтчет(ПараметрыОтчета, АдресХранилища = Неопределено) Экспорт
	
	ПараметрыОтчета.СписокСформированныхЛистов.Очистить();
	
	ПараметрыОтчета.НачалоПериода	= НачалоДня(ПараметрыОтчета.НачалоПериода);
	ПараметрыОтчета.КонецПериода	= КонецДня(ПараметрыОтчета.КонецПериода);
	
	// ПОДГОТОВКА ОТЧЕТА ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ
	
	ПодготовитьДанныеОтчета(ПараметрыОтчета);
	
	// ПОСТРОЕНИЕ ОТЧЕТА
	
	СформироватьТитульныйЛист(ПараметрыОтчета);
	
	СформироватьТаблицуДоходы(ПараметрыОтчета);
	
	Если АдресХранилища <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(ПараметрыОтчета.СписокСформированныхЛистов, АдресХранилища);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ПодготовитьДанныеОтчета(ПараметрыОтчета)
	
	НомераТаблиц	= Новый Структура;
	
	Запрос	= Новый Запрос;
	Запрос.УстановитьПараметр("Организация",	ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("Патент",			ПараметрыОтчета.Патент);
	Запрос.УстановитьПараметр("НачалоПериода",	ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",	ПараметрыОтчета.КонецПериода);
	Запрос.УстановитьПараметр("ПустаяДата",		Дата("00010101"));
	
	Запрос.Текст	= ТекстЗапросаТитульныйЛист(ПараметрыОтчета, НомераТаблиц)
					+ ТекстЗапросаКнигаУчетаДоходовПатент(ПараметрыОтчета, НомераТаблиц);
		
	Результат = Запрос.ВыполнитьПакет();

	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		
		Если Результат[НомерТаблицы.Значение] <> Неопределено Тогда
			ПараметрыОтчета.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаТитульныйЛист(ПараметрыОтчета, НомераТаблиц)
	
	НомераТаблиц.Вставить("БанковскиеСчета", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ДанныеПатента",   НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	БанковскиеСчета.НомерСчета КАК НомерСчета,
	|	БанковскиеСчета.Банк.Наименование КАК НаименованиеБанка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Организация
	|	И (БанковскиеСчета.ДатаОткрытия = &ПустаяДата
	|			ИЛИ БанковскиеСчета.ДатаОткрытия <= &КонецПериода)
	|	И (БанковскиеСчета.ДатаЗакрытия = &ПустаяДата
	|			ИЛИ БанковскиеСчета.ДатаЗакрытия >= &НачалоПериода)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Патенты.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ПоМестуНахожденияОрганизации)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВыданПоМестуЖительства,
	|	Патенты.КодПоОКТМО КАК КодПоОКТМО,
	|	ЕСТЬNULL(Патенты.НалоговыйОрган.КодРегиона, """") КАК НалоговыйОрганКодРегиона
	|ИЗ
	|	Справочник.Патенты КАК Патенты
	|ГДЕ
	|	Патенты.Ссылка = &Патент";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаКнигаУчетаДоходовПатент(ПараметрыОтчета, НомераТаблиц)
	
	НомераТаблиц.Вставить("КнигаУчетаДоходовПатент",	НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КнигаУчетаДоходовПатент.Регистратор КАК Регистратор,
	|	КнигаУчетаДоходовПатент.РеквизитыПервичногоДокумента КАК РеквизитыПервичногоДокумента,
	|	КнигаУчетаДоходовПатент.Содержание КАК Содержание,
	|	КнигаУчетаДоходовПатент.Графа4 КАК Графа4
	|ИЗ
	|	РегистрНакопления.КнигаУчетаДоходовПатент КАК КнигаУчетаДоходовПатент
	|ГДЕ
	|	КнигаУчетаДоходовПатент.Организация = &Организация
	|	И КнигаУчетаДоходовПатент.Патент = &Патент
	|	И КнигаУчетаДоходовПатент.Активность
	|	И КнигаУчетаДоходовПатент.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ КнигаУчетаДоходовПатент.Графа4 = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	КнигаУчетаДоходовПатент.Период,
	|	КнигаУчетаДоходовПатент.Регистратор,
	|	КнигаУчетаДоходовПатент.НомерСтроки
	|ИТОГИ
	|	СУММА(Графа4)
	|ПО
	|	ОБЩИЕ";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Процедура СформироватьТитульныйЛист(ПараметрыОтчета)
	
	СписокПоказателей = Новый СписокЗначений;
	СписокПоказателей.Добавить("", "ФИО");
	СписокПоказателей.Добавить("", "АдрПрописки");
	СписокПоказателей.Добавить("", "ОКПО");
	СписокПоказателей.Добавить("", "ИННФЛ");
	СписокПоказателей.Добавить("", "ОргСубъект");
	
	СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
		ПараметрыОтчета.Организация, ПараметрыОтчета.КонецПериода, СписокПоказателей);
		
	ТабличныйДокумент	= Новый ТабличныйДокумент;
	ТабличныйДокумент.Автомасштаб			= Истина;
	ТабличныйДокумент.ЧерноБелаяПечать		= Истина;
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_КнигаУчетаДоходовИРасходов_ТитульныйЛист";
	
	Если ПараметрыОтчета.КонецПериода < УчетУСН.ДатаНачалаДействияПатентнойСистемы() Тогда
		Макет	= ПолучитьМакет("ТитульныйЛист_154н");
	Иначе
		Макет	= ПолучитьМакет("ТитульныйЛист_патент");
	КонецЕсли;
	
	Макет.Параметры.НаПериод	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'на %1 год'"),
		Формат(Год(ПараметрыОтчета.КонецПериода), "ЧГ="));
		
	Макет.Параметры.ФИО			= СведенияОбОрганизации.ФИО;
	Макет.Параметры.АдрПрописки	= РегламентированнаяОтчетностьКлиентСервер.ПредставлениеАдресаВФормате9Запятых(СведенияОбОрганизации.АдрПрописки);
	Макет.Параметры.ОКПО		= СведенияОбОрганизации.ОКПО;
	
	ДанныеПатента = ПараметрыОтчета.ДанныеПатента.Выбрать();
	ДанныеПатента.Следующий(); // В выборке всегда одна запись
	Если ДанныеПатента.ВыданПоМестуЖительства Тогда
		НалоговыйОрган = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ПараметрыОтчета.Организация, "РегистрацияВНалоговомОргане");
			
		Макет.Параметры.ОКАТО                  = Справочники.РегистрацииВНалоговомОргане.КодТерритории(
			НалоговыйОрган, ПараметрыОтчета.КонецПериода);
		Макет.Параметры.НаименованиеСубъектаРФ = СведенияОбОрганизации.ОргСубъект;
	Иначе
		Макет.Параметры.ОКАТО                  = ДанныеПатента.КодПоОКТМО;
		Макет.Параметры.НаименованиеСубъектаРФ = АдресныйКлассификатор.НаименованиеРегионаПоКоду(
			ДанныеПатента.НалоговыйОрганКодРегиона);
	КонецЕсли;
	
	Счета = "";
	Выборка	= ПараметрыОтчета.БанковскиеСчета.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Счета	= Счета + ?(ПустаяСтрока(Счета), "", ", ")
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '№ %1 в %2'"), СокрЛП(Выборка.НомерСчета), СокрЛП(Выборка.НаименованиеБанка));
		
	КонецЦикла;
	Макет.Параметры.Счета	= Счета;
	
	Макет.Параметры.СрокПатента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'с %1 г. по %2 г.'"),
		Формат(ПараметрыОтчета.НачалоПериода, "ДФ='дд ММММ гггг'"),
		Формат(ПараметрыОтчета.КонецПериода, "ДФ='дд ММММ гггг'"));
	
	ТабличныйДокумент.Вывести(Макет);
	
	ИНН = СведенияОбОрганизации.ИННФЛ;
	
	Если СтрДлина(ИНН) <> 12 Тогда
		// Налогоплательщик - юр. лицо		
		ИНН = "00" + ИНН;		
	КонецЕсли;
	
	Ном = 1;
	Пока Ном > 0 Цикл
		ИмяОбластиИНН = "ПрИНН";
		Если НЕ(Ном > 12) Тогда
			ТабличныйДокумент.Область(ИмяОбластиИНН + Ном).Текст = ?(Число(ИНН) > 0, Сред(ИНН, Ном, 1), ""); 
			
			Ном = Ном + 1;
			Продолжить;
		КонецЕсли;
		Ном = 0;
	КонецЦикла;
		
	ПараметрыОтчета.СписокСформированныхЛистов.Добавить(ТабличныйДокумент, "Титульный лист");
	
КонецПроцедуры

Процедура СформироватьТаблицуДоходы(ПараметрыОтчета)
	
	ТабличныйДокумент	= Новый ТабличныйДокумент;
	ТабличныйДокумент.Автомасштаб			= Истина;
	ТабличныйДокумент.ЧерноБелаяПечать		= Истина;
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_КнигаУчетаДоходовПатент_ТаблицаДоходы";
	
	Если ПараметрыОтчета.КонецПериода < УчетУСН.ДатаНачалаДействияПатентнойСистемы() Тогда
		Макет	= ПолучитьМакет("Раздел1_154н");
	Иначе
		Макет	= ПолучитьМакет("Раздел1_патент");
	КонецЕсли;
	
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	=  Макет.ПолучитьОбласть("Строка");
	ОбластьИтого	= Макет.ПолучитьОбласть("Итого");
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ВыборкаОбщие	= ПараметрыОтчета.КнигаУчетаДоходовПатент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОБЩИЕ");
	Если ВыборкаОбщие.Следующий() Тогда
		
		НПП = 0;
		
		Выборка	= ВыборкаОбщие.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НПП = НПП + 1;
			
			ОбластьСтрока.Параметры.НомерПП = НПП;
			ОбластьСтрока.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		ОбластьИтого.Параметры.Заполнить(ВыборкаОбщие);
		ТабличныйДокумент.Вывести(ОбластьИтого);
		
	КонецЕсли;
	
	ТабличныйДокумент.ПовторятьПриПечатиСтроки	= ТабличныйДокумент.Область(6, , 6, );
	
	ПараметрыОтчета.СписокСформированныхЛистов.Добавить(ТабличныйДокумент, "Доходы");
	
КонецПроцедуры

#КонецЕсли
